app/controllers/autenticacion/login_controller.rb

    def create
        @usuario = Usuario.find_by("nombre = :nombre", {nombre: params[:nombre]}) # Busco el usuario cuyo correo es el que me mandan.
        #pp @usuario # Para imprimir por pantalla el usuario.

---
SELECT "usuarios".* FROM "usuarios" WHERE (nombre = 'hola@gmail.com') LIMIT $1  [["LIMIT", 1]]