app/controllers/autenticacion/register_controller.rb

SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."nombre" = $1 LIMIT $2  [["nombre", "dorleta"], ["LIMIT", 1]]
INSERT INTO "usuarios" ("nombre", "password_digest") VALUES ($1, $2) RETURNING "idusuario"  [["nombre", "dorleta"], ["password_digest", "[FILTERED]"]]
---
    def create
      @usuario = Usuario.new(user_params) #Obtengo los parametros

      # Compruebo que no existe ya un usuario con ese correo electronico.
      if Usuario.find_by(nombre: @usuario.nombre) # Si existe, devuelvo error al cliente
        @usuario.errors.add(:nombre, "ya existe")
        flash[:notice] = "El usuario ya existe!" # Configura el mensaje que deseas mostrar en el pop-up
        render :new, status: :unprocessable_entity
      else
        if @usuario.save # Intento guardar el nuevo usuario en la BBDD