app/controllers/formularionuevopedido_controller.rb

SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."nombre" = $1 LIMIT $2  [["nombre", "dorleta"], ["LIMIT", 1]]
INSERT INTO "pedidos" ("nombre", "telefono", "fecharecogida", "productos") VALUES ($1, $2, $3, $4) RETURNING "idpedido"  [["nombre", "Prueba1"], ["telefono", 234234], ["fecharecogida", nil], ["productos", "af"]]
---
    def newPedido
        #Obtengo el nombre del usuario.
        usuario = Usuario.find_by(nombre: session[:usuario_id])
        @newPedido = Pedidos.new(pedido_params)

        if @newPedido.save