app/controllers/formulariomodificarpedido_controller.rb

SELECT "pedidos".* FROM "pedidos" WHERE "pedidos"."idpedido" = $1 LIMIT $2  [["idpedido", 9], ["LIMIT", 1]]
---
  def new
    @pedido = Pedidos.find_by(idpedido: params[:id])

SELECT "pedidos".* FROM "pedidos" WHERE "pedidos"."idpedido" = $1 LIMIT $2  [["idpedido", 9], ["LIMIT", 1]]
UPDATE "pedidos" SET "nombre" = $1 WHERE "pedidos"."idpedido" = $2  [["nombre", "Javier"], ["idpedido", 9]]
---
  def modificar
    pedido_a_modificar = Pedidos.find_by(idpedido: params[:id])

    if params[:botones] == '0'
      redirect_to index_path(id: pedido_a_modificar.nombre), notice: 'Operación cancelada.'
    else
      if pedido_a_modificar.update(pedidos_params)