app/controllers/index_controller.rb

SELECT "pedidos".* FROM "pedidos" WHERE "pedidos"."idpedido" = $1 LIMIT $2  [["idpedido", 4], ["LIMIT", 1]]
DELETE FROM "pedidos" WHERE "pedidos"."idpedido" = $1  [["idpedido", 4]]
---
    def delete
      pedido = Pedidos.find(params[:idpedido])
      pedido.destroy

SELECT "pedidos".* FROM "pedidos" WHERE (DATE(fecharecogida) = '2024-01-21')
---
    def load_pedidos
      @pedidos = Pedidos.all